import pandas as pd

# 假设这是从文件中读取的ac_org字典
ac_org = {
    "ao1" : ["行政部门", "党政机关", "各级政府", "行政单位","行政机关","地方政府","司法机关","检察机关", 
             "有关部门","人民政府","财政部门","主管部门","管理部门","科研管理部门","科技管理部门",
             "中共中央", "国务院", "全国人民代表大会" , "全国人民代表大会常务委员会" , "中央军事委员会","国家监察委员会",
             "国务院办公厅" , "工业和信息化部" ,"教育部","教育厅","教委","教育局", "科技部" ,"科学技术部",  "人事部" , "财政部" ,"国家安全部","司法部" ,
             "文化和旅游部" ,"应急管理部" ,"民政部" , "人力资源和社会保障部" ,"人力资源社会保障部", "中国人民解放军总装备部" , "卫生部" ,"农业农村部" ,"自然资源部" ,
             "住房和城乡建设部", "住房城乡建设部" , "交通运输部" , "水利部" , "商务部" ,"外交部",
             "审计署","公安部","公安", "最高人民法院","最高法院", "最高人民检察院","最高检察院",             
             "国家卫生健康委员会","卫健委","卫生健康委","国家卫生和计划生育委员会" ,"国家科学技术委员会","国家科委","国家发展和改革委员会", "国家发展改革委" ,"发改委","国家民族事务委员会",  
             "中央军事委员会装备发展部","中央军委装备发展部" ,"中央军委科学技术委员会", "中共教育部党组" ,"中共中央纪律检查委员会",
             "中央宣传部","中宣部","中央网络安全和信息化委员会" ,"共青团中央" ,"中共中央办公厅" ,"中央组织部" ,"中央机构编制委员会" ,"中央机构编制委员会办公室","中共中央政策研究室", 
             "中央精神文明建设指导委员会","中央纪律检查委员会","中共中央纪委", "中央纪委","纪委",
             "中央网络安全和信息化委员会办公室","中央编办","中央文明办","中央网信办" , "中国共产党全国代表大会", "中国人民银行","人民银行" ],
    "ao2" : ["监管机构","科技管理机构","管理单位","项目管理机构","监察审计机构","项目管理专业机构",
            "中国科学院","中科院", "中国工程院","工程院","中国社会科学院","中国社科院","社科院","国家自然科学基金委员会", "国家自然基金委", "国家自然基金委员会","自然科学基金委","自然科学基金会","综合司局","专业司局","银保监会","证监会",
            "国家新闻出版署","国有资产监督管理委员会" ,"中华人民共和国海关总署","海关总署","中央广播电视总台","中国气象局","国家税务总局","税务总局","国家医疗保障局","医疗保障局","国家信访局",
            "国资委","新华通讯社","国家中医药管理局" ,"中国银行保险监督管理委员会","中国证券监督管理委员会" , "中国民用航空局" ,"民航局","国务院学位委员会",
            "中国国家铁路集团有限公司","铁路总公司" ,"国家铁路局" , "国家国防科技工业局" ,"国家科学技术奖励工作办公室" , "国家保密局","国家知识产权局","知识产权局",
            "国家新闻出版广电总局" , "国家烟草专卖局","市场监管总局","广电总局",
            "国务院发展研究中心" ,"国家国家市场监管总局","中共中央党校" ,"中央党史和文献研究院"],
    "ao3" : ["高等学校","高校",
             "科研院所","研究所","研究中心","研究院","研究院所",
             "科研机构","科技机构","研发机构","研究机构","资助机构","有关机构","科研诚信机构",
             "教育科研机构","科学技术研究开发机构","服务机构","第三方机构",
             "责任单位","责任主体","所属单位","承担单位","有关单位","所在单位","学位授予单位","提名单位",
             "企事业单位","企业","公司","事业单位",
             "出版社","学术期刊"],
    "ao4" : ["中国科学技术协会","中国科协", "学会", "协会", "研究会", "科技团体","社会组织","团体","中华全国总工会","全国总工会","工会","全国妇联","中华全国妇女联合会" ,"中国教科文卫体工会全国委员会"]
}

# 构建数据框架
data = []
for key, values in ac_org.items():
    for value in values:
        data.append({
            '作用主体ID': key,
            '作用主体': '党政机关' if key == 'ao1' else ('科研管理机构' if key == 'ao2' else ('责任主体单位' if key == 'ao3' else '科技/学术团体')),
            '作用主体实体': value
        })

df = pd.DataFrame(data)

# 读取政策主体实体CSV文件
policy_df = pd.read_csv('D:\\File_zyj\\2.论文文件\\4.小论文_政策知识图谱\\数据分析文件0929\\政策主体实体.csv')
global_counter = 1

# 匹配作用主体实体ID
for index, row in df.iterrows():
    matched_rows = policy_df[policy_df['政策主体'] == row['作用主体实体']]
    if not matched_rows.empty:
        df.at[index, '作用主体实体ID'] = matched_rows.iloc[0]['政策主体ID']
    else:
        id_str = f"ao-1-{global_counter:03d}"
        df.at[index, '作用主体实体ID'] = id_str
        global_counter += 1

# 保存到Excel文件
df.to_excel('D:\\File_zyj\\2.论文文件\\4.小论文_政策知识图谱\\数据分析文件0929\\作用主体实体.xlsx', index=False)
print("运行完成")
