import pandas as pd

# 读取Excel文件中的数据
file_path = 'data/paragraph.csv'
df = pd.read_excel(file_path, sheet_name='Sheet1')

# 定义措施类别的关键词
measures = {
    'm1': ['宣传', '教育', '培训', '普及', '意识', '认识','倡导'],
    'm2': ['监督', '举报', '调查', '审查', '受理', '核实', '取证', '失信行为', '曝光'],
    'm3': ['惩处', '惩罚', '纠正', '处理', '处分', '处罚','惩戒','严惩','批评','通报'],
    'm4': ['救济', '保护', '权益', '申诉', '复查', '诬告', '合法权益', '非失信行为','申辩','保密','上诉'],
    'm5': ['权责', '责任', '权力', '职责', '工作规章', '工作流程','工作机制'],
    'm6': ['标准', '界定', '定义', '范畴', '边界','下列情形','下列行为']
}
# 定义政策目标关键词
goals = {
    'g1': ['制','规则', '规章', '政策', '规程', '规范', '法规', '法律'],
    'g2': ['机制', '职责','监管', '管理', '工作', '程序', '负责','责任', '监督', '受理','工作流程'],
    'g3': ['信息系统', '信息管理', '信息共享', '共享联动', '动态管理', '动态记录', '信息平台', '信息化','信用记录','信息资源','数据库'],
    'g4': ['意识', '教育', '精神','宣传', '倡导', '弘扬', '自觉', '培训', '普及', '引导', '呼吁', '认识'],
    'g5': ['社会', '评价', '创新', '交流', '容错', '纠错', '知识产权', '学术监督', '科技管理', '项目管理']
}
# 定义政策工具关键词
instruments = {
    'i1': ['不得', '不准', '应', '要求', '必须', '惩戒', '打击', '严禁','不允许','处罚','严惩'],
    'i2': ['激励', '表彰', '表扬', '奖励', '补助','支持','拨款','福利','待遇', '刺激'],
    'i3': ['引导', '呼吁', '宣传', '建议', '积极', '倡导', '弘扬', '自觉','认识', '规劝','劝告','提倡'],
    'i4': ['教育', '培训', '经费','资源', '普及', '意识','投资','能力','素质'],
    'i5': ['成立', '设立', '建立', '出台', '制定', '负责','权责', '责任', '权力', '职责','机制','机构']
}
# 定义作用行为关键词
ac_behavior = {
    'ab1': ['科研行为', '研究行为', '科研活动', '研究','科学技术活动','科技活动'],
    'ab2': ['不端', '失信', '违规', '违反','惩处', '惩罚', '纠正', '处理', '处分', '处罚','惩戒','严惩','批评','通报'],
    'ab3': ['监督', '管理','监察','检查'],
    'ab4': ['举报', '证人','调查',"当事人", "责任人", "审查"]
}
# 定义分类函数
def classify_paragraph(paragraph, keyword_dict):
    labels = []
    for label, words in keyword_dict.items():
        if any(word in paragraph for word in words):
            labels.append(label)
    return ','.join(labels)
# 对“政策条文”列应用分类函数
df['政策措施'] = df['政策条文'].apply(lambda x: classify_paragraph(str(x), measures))
df['政策目标'] = df['政策条文'].apply(lambda x: classify_paragraph(str(x), goals))
df['政策工具'] = df['政策条文'].apply(lambda x: classify_paragraph(str(x), instruments))
df['作用行为'] = df['政策条文'].apply(lambda x: classify_paragraph(str(x), ac_behavior))
# 保存结果到CSV文件
output_path = 'data/train_dic.csv'
df.to_csv(output_path, index=False, encoding='utf-8-sig')

print(f"分类结果已保存到 {output_path}")
